const CV = () => {
  return (
    <div>
      <div className="flex flex-col text-center text-4xl">
        <h1>Muradil Koychubekov</h1>
        <h4>Frontend Developer</h4>
      </div>
      <div>
        <p>В мир IT я начал свой путь в 17 лет, еще находясь в школе. Мои первые шаги в программировании были сделаны с
          использованием таких языков, как PascalABC, C++ и Python 3. Сейчас я студент Кыргызского Российского
          Славянского Университета на факультете естественно-технических наук, где обучаюсь на специальности "Инженер
          инфокоммуникационных технологий и систем связи" (4 курс). На пути к своей профессиональной реализации я также
          посещаю курсы по программированию в "AttractorSchool" и активно работаю над улучшением своего английского
          языка, на данный момент мой уровен A2.</p>
      </div>
      <div>
        <h4 className="text-2xl">Основной стек</h4>
        <p>В моем опыте также присутствует работа в области верстки, где я занимался созданием веб-страниц с
          использованием HTML и CSS. Кроме того, я активно применял препроцессор Sass для повышения эффективности и
          управляемости стилей. Этот опыт в верстке и использование Sass позволили мне не только улучшить
          пользовательский интерфейс проектов, но и оптимизировать процесс разработки.</p>
        <p><strong>JavaScript: </strong>
          В рамках моего обучения на курсах по программированию на "AttractorSchool", я углубленно изучаю язык
          программирования JavaScript. Этот курс позволяет мне освоить основы и продвинутые концепции языка, которые я
          успешно применяю в создании динамичных веб-приложений. Полученные знания в JavaScript содействуют моему
          стремлению стать более компетентным разработчиком.</p>
        <p>
          <strong>React: </strong>
          В процессе обучения на тех же курсах я активно изучаю библиотеку React. Мой подход к этому фреймворку
          фокусируется на создании компонентов и построении интерфейсов, обеспечивая практическое применение полученных
          знаний. Это позволяет мне не только углубить свои навыки в React, но и непосредственно применять их в
          проектах, разрабатываемых на курсах.</p>
        <p>
          <strong>TypeScript: </strong>
          В рамках моего обучения на текущих курсах программирования я также изучаю TypeScript. Этот язык
          программирования добавляет строгую типизацию к JavaScript, что улучшает читаемость кода и уменьшает
          возможность ошибок. Полученные знания в TypeScript помогают мне создавать более надежные и структурированные
          веб-приложения, что соответствует моей цели стать квалифицированным инженером информационных технологий.
        </p>
        <p>Tекст еще в разработке...</p>
      </div>
    </div>
  );
};

export default CV;